; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image2 - mode
	image0 - mode
	thermograph1 - mode
	spectrograph4 - mode
	thermograph3 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star1 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star3)
	(supports instrument1 image2)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star1)
	(supports instrument3 thermograph3)
	(supports instrument3 spectrograph4)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(supports instrument4 spectrograph4)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Planet5 image0)
	(have_image Planet6 image2)
	(have_image Star7 thermograph1)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 thermograph1)
	(have_image Star10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 image2)
))

)

; plan
1. (turn_to satellite1 star3 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star3)
   goals met: 0 of 11
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 11
3. (calibrate satellite1 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 0 of 11
4. (turn_to satellite1 phenomenon13 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 11
5. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 11
6. (take_image satellite1 phenomenon13 instrument4 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 1 of 11
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 11
8. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 11
9. (turn_to satellite0 phenomenon14 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 11
10. (take_image satellite0 phenomenon14 instrument1 image2)
   added: (have_image phenomenon14 image2)
   goals met: 2 of 11
11. (turn_to satellite0 planet6 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet6)
   goals met: 2 of 11
12. (take_image satellite0 planet6 instrument1 image2)
   added: (have_image planet6 image2)
   goals met: 3 of 11
13. (turn_to satellite0 star3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star3)
   goals met: 4 of 11
14. (turn_to satellite1 phenomenon8 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 11
15. (take_image satellite1 phenomenon8 instrument4 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 5 of 11
16. (turn_to satellite1 planet11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet11)
   goals met: 5 of 11
17. (take_image satellite1 planet11 instrument4 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 6 of 11
18. (turn_to satellite1 planet12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet12)
   goals met: 6 of 11
19. (take_image satellite1 planet12 instrument4 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 7 of 11
20. (turn_to satellite1 planet5 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet5)
   goals met: 7 of 11
21. (take_image satellite1 planet5 instrument4 image0)
   added: (have_image planet5 image0)
   goals met: 8 of 11
22. (turn_to satellite1 planet9 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet9)
   goals met: 8 of 11
23. (take_image satellite1 planet9 instrument4 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 9 of 11
24. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 9 of 11
25. (take_image satellite1 star10 instrument4 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 10 of 11
26. (turn_to satellite1 star7 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star7)
   goals met: 10 of 11
27. (take_image satellite1 star7 instrument4 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 11 of 11
